---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.CostRateEnergy
source: html/17529c53-8ff7-88e5-d29e-462440486245.htm
---
# Autodesk.Revit.DB.SpecTypeId.CostRateEnergy Property

Cost Rate Energy, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId CostRateEnergy { get; }
```